<?php

$API_KEY = '
f9LHodD0cOKN8AxhX67Xmo3ma2zEEo3D2c2LZhVzD0zNgi1Wpc8EYYFsx55SY45OhH39jVI5wh6vLC0ePB73uw';
$tamtam = new tamtam($API_KEY);

class tamtam {
    function __construct($API_KEY) {
        $this->token = $API_KEY;
    }
    public function bot($chat, $meh, $data) {
        $url = "https://botapi.tamtam.chat/" . $meh . "?access_token=" . $this->token . "&chat_id=" . $chat;
        $ch = curl_init();
        curl_setopt($ch, CURLOPT_URL, $url);
        curl_setopt($ch, CURLOPT_RETURNTRANSFER, true);
        curl_setopt($ch, CURLOPT_POSTFIELDS, json_encode($data));
        $res = curl_exec($ch);
        return $res;
    }
}

$update = json_decode(file_get_contents('php://input'));
$message = $update->message;
$chat_id = $message->recipient->chat_id;
$text = $message->body->text;
$mid = $message->body->mid; 

    
$brrb = [
    '‏في رقة وجهكِ ، ڪُل الورود تتفتح 🪐',
    'وجودك بمثابة مِعطَف في ليلةٍ بارِدة ☘️', 
    'حبني بعد بيه عُمر يستاهِل سنينَك .',
     'شبعَد بِالرُّوح غِير منَاطِرَك سكتَه؟', 
    'احجي وياك وحدي وانتَ ما موجود', 
    'ما نَاوي تحن وترجع أيامنا؟',
     'اختر الطريق الذي يدلك عليه عقلك...
وإن تألمت لن تندم .', 
'إنتَ بَأوَل فُرصَة جَتّك ضَيّعِتنِي❤️.',
    'مَالهم بعيوني مكان ، إنتِ عُيوني كلها❤️.
    ', 'مثل سر البيوت بكلبي ضميتك❤️.', 
    'مالتِي ،وكلِش نحَس بَأشيائي❤️.',
     'أسَندچ بگلبي أذا جَان الچّتف مخلوَعَ❤️.', 
    'ويَا عينَ التكفي وبيها أخليك❤️.', 
    'اذا ناوي تروح ابفهم وين اروح❤️.',
     'ࢪكبه ونص كعد كل جࢪح نايم جان🐾.',
     'حَنين أكتبلج بين النبضة والنبضة 🐾.'
    ,'الراحل دون سبب لا يؤتمن أن عاد',
    'الما يأذي بهل وكت صاحب فضل🐾',
     'ناس ماتسوه الهلا ندللها ليش🐾؟',
     'أنا تعبَان جَاي إدفع ثمن غلطة🐾.', 
    'ليس غروراً .. إنما أنا فعلاً لا أعوض 🐾.', 
    'شَمْس صرنالكُم كَل مُغربَية نموت 🐾.',
     'وأدري الصَوچ بَيهم بَس گلت فِدوه 🐾.', 
    'وَ إن طَالت وَ إن ثَقُلت ، سَوف ننسى 🐾.', 
    'شعِندي غَيرك ياحِزن عِيني وَ بچيهَا 🐾.', 
    'گلبي الحنين التࢪف وياگم شسوه 🐾.؟',
     'والليالي الما ردتها تروح راحَت 🐾.', 
    'يبعد المَا يرمشن ، مِن يشوفنكَ 🐾.', 
    'يُوصَلنا السِره ويتأجَل المّوت 🐾.', 
    'موُ نَفس العُمر بس جِنت اّداريَك"',
     'فرشولي ريش وَ مانمت
بس يمك اغفى على الجمر.',
 'وَ أعظمُ الحُبِّ ، حُبُّ الرُّوحِ لِلرُّوحِ',
 '- وشفت بعيونك آمان وسلمت آمري .', 
    '‏صرتلك نهّر وآنَة بعِازة المّاي .',
     'عِزة نَفسي أهم مَن گلبي بهّواي 
وكسرَة خاطري تِسواك كُلك .',
 'السَكته تكِتل ولحچي يزعِل عَرب !',
 'زحمَة اشتَاگلك وانتَ بغِيري تتُوسَل .', 
    'شحلات السالفه التحچيها بعيونك.',
     'هَسِهَ انِا كُلش مّقتِنعَ اسَتاهِل احِسنّ مِنكَ .', 
    'يَا چَوّيَاتَ رُوّحِيَ المَا اظِنَ تُبرّدَ .', 
    'صفَنتلهَا ولگيت اليبتِعد يرتَاح.', 
    'كلمة حَبيبي انتهتَ شختارلك كلمه؟',
     'تعَال الليل نعَس وانَا اسُولِف بيّك .', 
    'شِيردك بعَد ، چَنك ايام الخِير .',
     'حَسبالي حچيك صدك وعَيونك تحَبني .', 
    'ناطرتك للفجر هلبت تحس بيه .', 
    'أَكو الحِلوة وأَكو الأحلىٰ وأَكو عيُونچ .', 
    'يَسالفتُي الطوَيلة المَاگظت فَد يوَم',
     'يَـ كون العُمر مابي ناس بَس انتَ🫂', 
    'هضيمَه ارجع وگلكَ.. بعدك تحبنيِ؟!', 
    'المشكلة عيونك هنّه هنّه 
چا وين وديت المَحنّة ؟',
 'وطلّع كِل الرسمته أوهام بأوهام ..', 
'لو تدري بيه شصار ساعات الوداع 
اوگع سبع مرات من طولي للگاع 🧑‍🦯',
 'مايحتاج أخطبڪ حتى اڪمل الدين
أنـي بشـوفٓ وَجهڪ ديـني ڪَملته. ♥', 
    'تفاركنه ونسيتك والعشگ راح
چا ليش من اشوفك تضحك ارتاح',
 'چَان أخر عِشك وأنتَهت كُل قَصه
مَثل دَرس الأخِير المَا ورا فرصَة.', 
'المعركى انتهت والنصر كان افراق
صح رتك الي بس الله ما راد',
 'ما شَايل حقَد شَايل طبَع تنَور

يحَرِگوني بحِطَب وأنَطيهم

 الخَبِزه .', 
    'حَنِين ومِن ازعلك ما انام اسبوع
 صَلف وينام جفنك مِن تزعلني .',
 'كون اشوف الحِزن
شارد كون اغمض عيُوني
ليلة وراسِي بَارد .🥺❤️', 
    
];

$order = ['شعر','شع','ش'];

if(in_array(strtolower($text), $order)) {
    $tamtam->bot($chat_id, 'messages', [
    'text'=> "•⊱ **".$brrb[array_rand($brrb)] ."** .",
    'format'=> 'markdown',
    'link'=> ['type'=> 'reply',
               'mid'=> $mid],
    ]);
}
